CloudedQuartz/Marlin/Marlin/src/HAL/HC32/tft/tft_spi.cpp
/**
 * Marlin 3D Printer Firmware
 * Copyright (c) 2020 MarlinFirmware [https://github.com/MarlinFirmware/Marlin]
 *
 * Based on Sprinter and grbl.
 * Copyright (c) 2011 Camiel Gubbels / Erik van der Zalm
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 */


#if HAS_SPI_TFT

#include "tft_spi.h"
   uint8_t TFT_SPI::data_type;

void TFT_SPI::init() {
      data_type=DATASIZE_16BIT;
}

void TFT_SPI::dataTransferBegin(uint16_t DataSize) {
     data_type=DataSize&0xff;
}

#ifdef TFT_DEFAULT_DRIVER
  #include "../../../lcd/tft_io/tft_ids.h"
#endif

uint32_t TFT_SPI::getID() {
//  uint32_t id;
//  id = ReadID(LCD_READ_ID);
//  if ((id & 0xFFFF) == 0 || (id & 0xFFFF) == 0xFFFF) {
//    id = ReadID(LCD_READ_ID4);
//    #ifdef TFT_DEFAULT_DRIVER
//      if ((id & 0xFFFF) == 0 || (id & 0xFFFF) == 0xFFFF)
//        id = TFT_DEFAULT_DRIVER;
//    #endif
//   }
//  return id;
  return 0;
}

uint32_t TFT_SPI::ReadID(uint16_t Reg) {
//  uint32_t Data = 0;
//  #if PIN_EXISTS(TFT_MISO)
//    uint32_t BaudRatePrescaler = SPIx.Init.BaudRatePrescaler;
//    uint32_t i;

//    SPIx.Init.BaudRatePrescaler = SPIx.Instance == SPI1 ? SPI_BAUDRATEPRESCALER_8 : SPI_BAUDRATEPRESCALER_4;
//    DataTransferBegin(DATASIZE_8BIT);
//    WriteReg(Reg);

//    if (SPIx.Init.Direction == SPI_DIRECTION_1LINE) SPI_1LINE_RX(&SPIx);
//    __HAL_SPI_ENABLE(&SPIx);

//    for (i = 0; i < 4; i++) {
//      #if TFT_MISO_PIN != TFT_MOSI_PIN
//        //if (hspi->Init.Direction == SPI_DIRECTION_2LINES) {
//          while ((SPIx.Instance->SR & SPI_FLAG_TXE) != SPI_FLAG_TXE) {}
//          SPIx.Instance->DR = 0;
//        //}
//      #endif
//      while ((SPIx.Instance->SR & SPI_FLAG_RXNE) != SPI_FLAG_RXNE) {}
//      Data = (Data << 8) | SPIx.Instance->DR;
//    }

//    __HAL_SPI_DISABLE(&SPIx);
//    DataTransferEnd();

//    SPIx.Init.BaudRatePrescaler   = BaudRatePrescaler;
//  #endif

//  return Data >> 7;
    return 0;
}

bool TFT_SPI::isBusy() {


//    volatile bool dmaEnabled = (DMAtx.Instance->CCR & DMA_CCR_EN) != RESET;

//  if (dmaEnabled) {
//    if (__HAL_DMA_GET_FLAG(&DMAtx, __HAL_DMA_GET_TC_FLAG_INDEX(&DMAtx)) != 0 || __HAL_DMA_GET_FLAG(&DMAtx, __HAL_DMA_GET_TE_FLAG_INDEX(&DMAtx)) != 0)
//      Abort();
//  }
//  else
//    Abort();
//  return dmaEnabled;
  return 0;
}

void TFT_SPI::abort() {
//  // Wait for any running spi
//  while ((SPIx.Instance->SR & SPI_FLAG_TXE) != SPI_FLAG_TXE) {}
//  while ((SPIx.Instance->SR & SPI_FLAG_BSY) == SPI_FLAG_BSY) {}
//  // First, abort any running dma
//  HAL_DMA_Abort(&DMAtx);
//  // DeInit objects
//  HAL_DMA_DeInit(&DMAtx);
//  HAL_SPI_DeInit(&SPIx);
//  // Deselect CS
//  DataTransferEnd();
}

void TFT_SPI::Transmit(uint16_t Data) {
     if( data_type==DATASIZE_16BIT)
     {
       LCD_WR_DATA(Data); 
     }
     else
     {
       LCD_WR_DATA8(Data&0xff);
     }
//  if (TFT_MISO_PIN == TFT_MOSI_PIN)
//    SPI_1LINE_TX(&SPIx);

//  __HAL_SPI_ENABLE(&SPIx);

//  SPIx.Instance->DR = Data;

//  while ((SPIx.Instance->SR & SPI_FLAG_TXE) != SPI_FLAG_TXE) {}
//  while ((SPIx.Instance->SR & SPI_FLAG_BSY) == SPI_FLAG_BSY) {}

//  if (TFT_MISO_PIN != TFT_MOSI_PIN)
//    __HAL_SPI_CLEAR_OVRFLAG(&SPIx);   // Clear overrun flag in 2 Lines communication mode because received is not read
}

void TFT_SPI::TransmitDMA(uint32_t MemoryIncrease, uint16_t *Data, uint16_t Count) {
  // Wait last dma finish, to start another
//  while (isBusy()) { /* nada */ }

//  DMAtx.Init.MemInc = MemoryIncrease;
//  HAL_DMA_Init(&DMAtx);

//  if (TFT_MISO_PIN == TFT_MOSI_PIN)
//    SPI_1LINE_TX(&SPIx);

//  DataTransferBegin();

//  HAL_DMA_Start(&DMAtx, (uint32_t)Data, (uint32_t)&(SPIx.Instance->DR), Count);
//  __HAL_SPI_ENABLE(&SPIx);

//  SET_BIT(SPIx.Instance->CR2, SPI_CR2_TXDMAEN);   // Enable Tx DMA Request

//  HAL_DMA_PollForTransfer(&DMAtx, HAL_DMA_FULL_TRANSFER, HAL_MAX_DELAY);
//  Abort();
}

#endif // HAS_SPI_TFT

#include "hc32_ddl.h"
#include "bsp_logo_data.h"

void Show_logo_secreen()
{
	u32 i,j; 
  u8 p;
  uint8_t  R1,G1,B1;  

	LCD_Address_Set(0,0,LCD_W-1,LCD_H-1);//������ʾ��Χ
	for(i=0;i<76800;i++)
	{													   	 	

      p=_ac[i];
      R1=GUI_COLOR_Colors4[p]>>16;
      G1=(GUI_COLOR_Colors4[p]>>8)&0xff;
      B1=(GUI_COLOR_Colors4[p])&0xff;
    
      R1=R1>>3;
      G1=G1>>2;
      B1=B1>>3;
			LCD_WR_DATA((B1<<11)+ (G1<<5)+R1);
      p++;

	} 	
}
//***************��ʱ������Ҫ����ʱ��׼ȷ��*******************************
void delay_ms(u16 count)
{
  u16 i;
  for(i=0;i<count;i++)
  {
  //  __NOP();
  }
}

static void Spi_DmaConfig(void)
{
//    stc_dma_config_t stcDmaCfg;

//    /* configuration structure initialization */
//    MEM_ZERO_STRUCT(stcDmaCfg);

//    /* Configuration peripheral clock */
//    PWC_Fcg0PeriphClockCmd(SPI_DMA_CLOCK_UNIT, Enable);
//    PWC_Fcg0PeriphClockCmd(PWC_FCG0_PERIPH_AOS, Enable);

//    /* Configure TX DMA */
//    stcDmaCfg.u16BlockSize = 1u;
//    stcDmaCfg.u16TransferCnt = u16BufferLen;
//    stcDmaCfg.u32SrcAddr = (uint32_t)(&u8TxBuffer[0]);
//    stcDmaCfg.u32DesAddr = (uint32_t)(&SPI_UNIT->DR);
//    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressIncrease;
//    stcDmaCfg.stcDmaChCfg.enDesInc = AddressFix;
//    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma8Bit;
//    stcDmaCfg.stcDmaChCfg.enIntEn = Disable;
//    DMA_InitChannel(SPI_DMA_UNIT, SPI_DMA_TX_CHANNEL, &stcDmaCfg);

//    /* Configure RX DMA */
//    stcDmaCfg.u16BlockSize = 1u;
//    stcDmaCfg.u16TransferCnt = u16BufferLen;
//    stcDmaCfg.u32SrcAddr = (uint32_t)(&SPI_UNIT->DR);
//    stcDmaCfg.u32DesAddr = (uint32_t)(&u8RxBuffer[0]);
//    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressFix;
//    stcDmaCfg.stcDmaChCfg.enDesInc = AddressIncrease;
//    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma8Bit;
//    stcDmaCfg.stcDmaChCfg.enIntEn = Disable;
//    DMA_InitChannel(SPI_DMA_UNIT, SPI_DMA_RX_CHANNEL, &stcDmaCfg);

//    DMA_SetTriggerSrc(SPI_DMA_UNIT, SPI_DMA_TX_CHANNEL, SPI_DMA_TX_TRIG_SOURCE);
//    DMA_SetTriggerSrc(SPI_DMA_UNIT, SPI_DMA_RX_CHANNEL, SPI_DMA_RX_TRIG_SOURCE);

//    /* Enable DMA. */
//    DMA_Cmd(SPI_DMA_UNIT, Enable);
}
void LCD_GPIO_Init(void)
{
   uint8_t index;
  stc_spi_init_t stcSpiInit;
  stc_port_init_t stcPortInit;
    MEM_ZERO_STRUCT(stcPortInit);
  
  #ifndef moni_spi
  
  
  
  
  
  
     tft_RS_L(); 
     PORT_SetFunc(tft_RS_PORT, tft_RS_PIN, Func_Gpio, Disable);
    stcPortInit.enPinMode = Pin_Mode_Out;
    PORT_Init(tft_RS_PORT, tft_RS_PIN, &stcPortInit);
    tft_RS_H();
  
//      stcPortInit.enPinMode = Pin_Mode_In;
//    PORT_Init(tft_RES_PORT, tft_RES_PIN, &stcPortInit);
//    tft_RES_L() ;
//    for(index=0;index<50;index++)
//              {
//               delay_ms(50000);
//              }
//     tft_RES_H();
//    for(index=0;index<200;index++)
//              {
//               delay_ms(50000);
//              }
//    tft_RES_L() ;
//    for(index=0;index<50;index++)
//              {
//               delay_ms(50000);
//              }
//     tft_RES_H();
//    for(index=0;index<200;index++)
//              {
//               delay_ms(50000);
//              }   



  
    PORT_Init(BL_port, BL_pin, &stcPortInit);
    //BL_ON;
    /* configuration structure initialization */
    MEM_ZERO_STRUCT(stcSpiInit);

    /* Configuration peripheral clock */
    PWC_Fcg1PeriphClockCmd(SPI_UNIT_CLOCK, Enable);

    /* Configuration SPI pin */
    PORT_SetFunc(SPI_SCK_PORT, SPI_SCK_PIN, SPI_SCK_FUNC, Disable);
    PORT_SetFunc(tft_CS_PORT, tft_CS_PIN, Func_Spi2_Nss0, Disable);
    PORT_SetFunc(SPI_MOSI_PORT, SPI_MOSI_PIN, SPI_MOSI_FUNC, Disable);
 //   PORT_SetFunc(SPI_MISO_PORT, SPI_MISO_PIN, SPI_MISO_FUNC, Disable);

