CloudedQuartz/Marlin/Marlin/src/HAL/HC32/tft/tft_spi.cpp
    /* Configuration SPI structure */
    stcSpiInit.enClkDiv = SpiClkDiv2;
    stcSpiInit.enFrameNumber = SpiFrameNumber1;
    stcSpiInit.enDataLength = SpiDataLengthBit8;
    stcSpiInit.enFirstBitPosition = SpiFirstBitPositionMSB;
    stcSpiInit.enSckPolarity = SpiSckIdleLevelLow;
    stcSpiInit.enSckPhase = SpiSckOddSampleEvenChange;
    stcSpiInit.enReadBufferObject = SpiReadReceiverBuffer;
    stcSpiInit.enWorkMode = SpiWorkMode4Line;
    stcSpiInit.enTransMode = SpiTransFullDuplex;
    stcSpiInit.enCommAutoSuspendEn = Disable;
    stcSpiInit.enModeFaultErrorDetectEn = Disable;
    stcSpiInit.enParitySelfDetectEn = Disable;
    stcSpiInit.enParityEn = Disable;
    stcSpiInit.enParity = SpiParityEven;


    stcSpiInit.enMasterSlaveMode = SpiModeMaster;
    stcSpiInit.stcDelayConfig.enSsSetupDelayOption = SpiSsSetupDelayCustomValue;
    stcSpiInit.stcDelayConfig.enSsSetupDelayTime = SpiSsSetupDelaySck1;
    stcSpiInit.stcDelayConfig.enSsHoldDelayOption = SpiSsHoldDelayCustomValue;
    stcSpiInit.stcDelayConfig.enSsHoldDelayTime = SpiSsHoldDelaySck1;
    stcSpiInit.stcDelayConfig.enSsIntervalTimeOption = SpiSsIntervalCustomValue;
    stcSpiInit.stcDelayConfig.enSsIntervalTime = SpiSsIntervalSck6PlusPck2;
    stcSpiInit.stcSsConfig.enSsValidBit = SpiSsValidChannel0;
    stcSpiInit.stcSsConfig.enSs0Polarity = SpiSsLowValid;


#ifdef SPI_SLAVE_MODE
    stcSpiInit.enMasterSlaveMode = SpiModeSlave;
    stcSpiInit.stcSsConfig.enSsValidBit = SpiSsValidChannel0;
    stcSpiInit.stcSsConfig.enSs0Polarity = SpiSsLowValid;
#endif

    SPI_Init(SPI_UNIT, &stcSpiInit);
    SPI_Cmd(SPI_UNIT, Enable);
    
   #else
    PORT_SetFunc(tft_CS_PORT, tft_CS_PIN, Func_Gpio, Disable);
  
    stcPortInit.enPinMode = Pin_Mode_Out;
    PORT_Init(tft_CS_PORT, tft_CS_PIN, &stcPortInit);
    tft_CS_H();
       PORT_Init(BL_port, BL_pin, &stcPortInit);
    //BL_ON;
    PORT_SetFunc(tft_RS_PORT, tft_RS_PIN, Func_Gpio, Disable);
    stcPortInit.enPinMode = Pin_Mode_Out;
    PORT_Init(tft_RS_PORT, tft_RS_PIN, &stcPortInit);
    
    
     PORT_Init(SPI_SCK_PORT, SPI_SCK_PIN, &stcPortInit);
     tft_SCK_H();
     PORT_Init(SPI_MOSI_PORT, SPI_MOSI_PIN, &stcPortInit);
    #endif
}


/******************************************************************************
      ����˵����LCD��������д�뺯��
      ������ݣ�dat  Ҫд��Ĵ�������
      ����ֵ��  ��
******************************************************************************/
void LCD_Writ_Bus(u8 dat) 
{	


  #ifndef moni_spi
      //SPI_ReceiveData8(SPI_UNIT);   //���ϴε�����
      //SPI_UNIT->DR;
	  //SPI_UNIT->DR = dat;
      SPI_SendData8(SPI_UNIT, dat);
            /* Wait rx buffer full */
      while (Reset == SPI_GetFlag(SPI_UNIT, SpiFlagSendBufferEmpty))
	  {
	  	
	  }
            
            
      
  #else
  char i;
 	tft_CS_L();
	//LCD_GPIO_PORRC |= SCLK;
  	for(i=0;i<8;i++)
	{		
     delay_ms(1);	  
	 tft_SCK_L();
	 //LCD_GPIO_PORRC |= SCLK;
		if(dat&0x80)
		{
		   tft_MOSI_H();
		   //LCD_GPIO_POSRC |= MOSI;
		}
		else
		{
		   tft_MOSI_L();
		   //LCD_GPIO_PORRC |= MOSI
		}
		tft_SCK_H();
		//LCD_GPIO_POSRC |= SCLK;
		dat<<=1;
	}	
  tft_CS_H();
	//LCD_GPIO_POSRC |= SCLK;
  #endif

}


/******************************************************************************
      ����˵����LCDд������
      ������ݣ�dat д�������
      ����ֵ��  ��
******************************************************************************/
void LCD_WR_DATA8(u8 dat)
{

	LCD_Writ_Bus(dat);
}


/******************************************************************************
      ����˵����LCDд������
      ������ݣ�dat д�������
      ����ֵ��  ��
******************************************************************************/
void LCD_WR_DATA(u16 dat)
{
	LCD_Writ_Bus(dat>>8);
	LCD_Writ_Bus(dat);
}


/******************************************************************************
      ����˵����LCDд������
      ������ݣ�dat д�������
      ����ֵ��  ��
******************************************************************************/
void LCD_WR_REG(u8 dat)
{
	tft_RS_L();//д����

	LCD_Writ_Bus(dat);
  	delay_ms(1);
	tft_RS_H();//д����

}


/******************************************************************************
      ����˵����������ʼ�ͽ�����ַ
      ������ݣ�x1,x2 �����е���ʼ�ͽ�����ַ
                y1,y2 �����е���ʼ�ͽ�����ַ
      ����ֵ��  ��
******************************************************************************/
void LCD_Address_Set(u16 x1,u16 y1,u16 x2,u16 y2)
{
		LCD_WR_REG(0x2a);//�е�ַ����
		LCD_WR_DATA(x1);
		LCD_WR_DATA(x2);
		LCD_WR_REG(0x2b);//�е�ַ����
		LCD_WR_DATA(y1);
		LCD_WR_DATA(y2);
		LCD_WR_REG(0x2c);//������д
}

void LCD_Init(void)
{
 
	LCD_GPIO_Init();//��ʼ��GPIO


	
//	LCD_BLK_Set();//�򿪱���
//  delay_ms(100);
//	
//	//************* Start Initial Sequence **********//
//	LCD_WR_REG(0x11); //Sleep out 
//	delay_ms(120);    //Delay 120ms 
//	//************* Start Initial Sequence **********// 
//	LCD_WR_REG(0Xf0);
//	LCD_WR_DATA8(0xc3);
//	LCD_WR_REG(0Xf0);
//	LCD_WR_DATA8(0x96);
//	LCD_WR_REG(0x36);    // Memory Access Control 
//	if(USE_HORIZONTAL==0)LCD_WR_DATA8(0x40);
//	else if(USE_HORIZONTAL==1)LCD_WR_DATA8(0x80);
//	else if(USE_HORIZONTAL==2)LCD_WR_DATA8(0xB0);
//	else LCD_WR_DATA8(0xE0);
//	
//	LCD_WR_REG(0x3A);
//	LCD_WR_DATA8(0x55);
//	
//	LCD_WR_REG(0Xe8);
//	LCD_WR_DATA8(0x40);
//	LCD_WR_DATA8(0x82);
//	LCD_WR_DATA8(0x07);
//	LCD_WR_DATA8(0x18);
//	LCD_WR_DATA8(0x27);
//	LCD_WR_DATA8(0x0a);
//	LCD_WR_DATA8(0xb6);
//	LCD_WR_DATA8(0x33);
//	
//	LCD_WR_REG(0Xc5);
//	LCD_WR_DATA8(0x27);
//	
//	LCD_WR_REG(0Xc2);
//	LCD_WR_DATA8(0xa7);
//	
//	LCD_WR_REG(0Xe0);
//	LCD_WR_DATA8(0xf0);
//	LCD_WR_DATA8(0x01);
//	LCD_WR_DATA8(0x06);
//	LCD_WR_DATA8(0x0f);
//	LCD_WR_DATA8(0x12);
//	LCD_WR_DATA8(0x1d);
//	LCD_WR_DATA8(0x36);
//	LCD_WR_DATA8(0x54);
//	LCD_WR_DATA8(0x44);
//	LCD_WR_DATA8(0x0c);
//	LCD_WR_DATA8(0x18);
//	LCD_WR_DATA8(0x16);
//	LCD_WR_DATA8(0x13);
//	LCD_WR_DATA8(0x15);
//	
//	LCD_WR_REG(0Xe1);
//	LCD_WR_DATA8(0xf0);
//	LCD_WR_DATA8(0x01);
//	LCD_WR_DATA8(0x05);
//	LCD_WR_DATA8(0x0a);
//	LCD_WR_DATA8(0x0b);
//	LCD_WR_DATA8(0x07);
//	LCD_WR_DATA8(0x32);
//	LCD_WR_DATA8(0x44);
//	LCD_WR_DATA8(0x44);
//	LCD_WR_DATA8(0x0c);
//	LCD_WR_DATA8(0x18);
//	LCD_WR_DATA8(0x17);
//	LCD_WR_DATA8(0x13);
//	LCD_WR_DATA8(0x16);
//	
//	LCD_WR_REG(0Xf0);
//	LCD_WR_DATA8(0x3c);
//	
//	LCD_WR_REG(0Xf0);
//	LCD_WR_DATA8(0x69);
//	
//	LCD_WR_REG(0X29);	 

