CloudedQuartz/Marlin/Marlin/src/HAL/HC32/tft/tft_spi.cpp
//LCD_WR_REG(0x11);
//delay_ms(20000);	
//LCD_WR_REG(0x21);
//LCD_WR_REG(0x29); 	
//delay_ms(10000);
//	
//LCD_WR_REG(0x3A);
//LCD_WR_DATA8(0x55);//55��565��Ҳ����16λ��66��666��Ҳ����18λ��77����888����24λ(ע�⣺��Ҫ��֧��24λ��Һ�����ſ�����77)
//LCD_WR_REG(0x36);
//LCD_WR_DATA8(0xE8);// D3λȡ����RGB��RB������D5λȡ�������л���������D6��D7λ��x��y��ľ���

//***********************************************
//-----------------------------------ST7789V reset sequence------------------------------------//
//LCD_RESET=1;
//Delayms(1); //Delay 1ms
//LCD_RESET=0;
//Delayms(10); //Delay 10ms
//LCD_RESET=1;
//Delayms(120);  //Delay 120ms
//---------------------------------------------------------------------------------------------------//
      LCD_WR_REG( 0x11);
      Ddl_Delay1ms(120);
              //------------------------------display and color format setting--------------------------------//
      LCD_WR_REG( 0x36);    //dir
      LCD_WR_DATA8(0xb0);


      LCD_WR_REG( 0x3a);
      LCD_WR_DATA8( 0x5);
              //--------------------------------ST7789V Frame rate setting----------------------------------//
      LCD_WR_REG( 0xb2);
//      LCD_WR_DATA8( 0x0c);
//      LCD_WR_DATA8( 0x0c);
      LCD_WR_DATA8( 0x05);
      LCD_WR_DATA8( 0x05);
      LCD_WR_DATA8( 0x00);
      LCD_WR_DATA8( 0x33);
      LCD_WR_DATA8( 0x33);
			
      LCD_WR_REG( 0xb7);
      LCD_WR_DATA8( 0x35);
    
                //---------------------------------ST7789V Power setting--------------------------------------//
      LCD_WR_REG( 0xbb);
      LCD_WR_DATA8( 0x28);
			
      LCD_WR_REG( 0xc0);
      LCD_WR_DATA8( 0x2c);
			
      LCD_WR_REG( 0xc2);
      LCD_WR_DATA8( 0x01);
			
      LCD_WR_REG( 0xc3);
      LCD_WR_DATA8( 0x0b);
			
      LCD_WR_REG( 0xc4);
      LCD_WR_DATA8( 0x20);
			
      LCD_WR_REG( 0xc6);
      LCD_WR_DATA8( 0x0f);
			
      LCD_WR_REG( 0xd0);
      LCD_WR_DATA8( 0xa4);
      LCD_WR_DATA8( 0xa1);
         //--------------------------------ST7789V gamma setting---------------------------------------//
      LCD_WR_REG( 0xe0);
      LCD_WR_DATA8( 0xd0);
      LCD_WR_DATA8( 0x01);
      LCD_WR_DATA8( 0x08);
      LCD_WR_DATA8( 0x0f);
      LCD_WR_DATA8( 0x11);
      LCD_WR_DATA8( 0x2a);
      LCD_WR_DATA8( 0x36);
      LCD_WR_DATA8( 0x55);
      LCD_WR_DATA8( 0x44);
      LCD_WR_DATA8( 0x3a);
      LCD_WR_DATA8( 0x0b);
      LCD_WR_DATA8( 0x06);
      LCD_WR_DATA8( 0x11);
      LCD_WR_DATA8( 0x20);
			
      LCD_WR_REG( 0xe1);
      LCD_WR_DATA8( 0xd0);
      LCD_WR_DATA8( 0x02);
      LCD_WR_DATA8( 0x07);
      LCD_WR_DATA8( 0x0a);
      LCD_WR_DATA8( 0x0b);
      LCD_WR_DATA8( 0x18);
      LCD_WR_DATA8( 0x34);
      LCD_WR_DATA8( 0x43);
      LCD_WR_DATA8( 0x4a);
      LCD_WR_DATA8( 0x2b);
      LCD_WR_DATA8( 0x1b);
      LCD_WR_DATA8( 0x1c);
      LCD_WR_DATA8( 0x22);
      LCD_WR_DATA8( 0x1f);
      LCD_WR_REG( 0x29);   //
	  //LCD_Fill(0,320,0,240,0x0000);
	  //SysTick_Delay(120);
      
} 




/////////////*/*******************************************************************/



/******************************************************************************
      ����˵������ָ�����������ɫ
      ������ݣ�xsta,ysta   ��ʼ����
                xend,yend   ��ֹ����
								color       Ҫ������ɫ
      ����ֵ��  ��
******************************************************************************/
void LCD_Fill(u16 xsta,u16 ysta,u16 xend,u16 yend,u16 color)
{          
	u16 i,j; 
	LCD_Address_Set(xsta,ysta,xend-1,yend-1);//������ʾ��Χ
	for(i=ysta;i<yend;i++)
	{													   	 	
		for(j=xsta;j<xend;j++)
		{
			LCD_WR_DATA(color);
		}
	} 					  	    
}

/******************************************************************************
      ����˵������ָ��λ�û���
      ������ݣ�x,y ��������
                color �����ɫ
      ����ֵ��  ��
******************************************************************************/
void LCD_DrawPoint(u16 x,u16 y,u16 color)
{
	LCD_Address_Set(x,y,x,y);//���ù��λ�� 
	LCD_WR_DATA(color);
} 


/******************************************************************************
      ����˵��������
      ������ݣ�x1,y1   ��ʼ����
                x2,y2   ��ֹ����
                color   �ߵ���ɫ
      ����ֵ��  ��
******************************************************************************/
void LCD_DrawLine(u16 x1,u16 y1,u16 x2,u16 y2,u16 color)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance;
	int incx,incy,uRow,uCol;
	delta_x=x2-x1; //������������ 
	delta_y=y2-y1;
	uRow=x1;//�����������
	uCol=y1;
	if(delta_x>0)incx=1; //���õ������� 
	else if (delta_x==0)incx=0;//��ֱ�� 
	else {incx=-1;delta_x=-delta_x;}
	if(delta_y>0)incy=1;
	else if (delta_y==0)incy=0;//ˮƽ�� 
	else {incy=-1;delta_y=-delta_y;}
	if(delta_x>delta_y)distance=delta_x; //ѡȡ�������������� 
	else distance=delta_y;
	for(t=0;t<distance+1;t++)
	{
		LCD_DrawPoint(uRow,uCol,color);//����
		xerr+=delta_x;
		yerr+=delta_y;
		if(xerr>distance)
		{
			xerr-=distance;
			uRow+=incx;
		}
		if(yerr>distance)
		{
			yerr-=distance;
			uCol+=incy;
		}
	}
}


/******************************************************************************
      ����˵����������
      ������ݣ�x1,y1   ��ʼ����
                x2,y2   ��ֹ����
                color   ���ε���ɫ
      ����ֵ��  ��
******************************************************************************/
void LCD_DrawRectangle(u16 x1, u16 y1, u16 x2, u16 y2,u16 color)
{
	LCD_DrawLine(x1,y1,x2,y1,color);
	LCD_DrawLine(x1,y1,x1,y2,color);
	LCD_DrawLine(x1,y2,x2,y2,color);
	LCD_DrawLine(x2,y1,x2,y2,color);
}


/******************************************************************************
      ����˵������Բ
      ������ݣ�x0,y0   Բ������
                r       �뾶
                color   Բ����ɫ
      ����ֵ��  ��
******************************************************************************/
void Draw_Circle(u16 x0,u16 y0,u8 r,u16 color)
{
	int a,b;
	a=0;b=r;	  
	while(a<=b)
	{
		LCD_DrawPoint(x0-b,y0-a,color);             //3           
		LCD_DrawPoint(x0+b,y0-a,color);             //0           
		LCD_DrawPoint(x0-a,y0+b,color);             //1                
		LCD_DrawPoint(x0-a,y0-b,color);             //2             
		LCD_DrawPoint(x0+b,y0+a,color);             //4               
		LCD_DrawPoint(x0+a,y0-b,color);             //5
		LCD_DrawPoint(x0+a,y0+b,color);             //6 
		LCD_DrawPoint(x0-b,y0+a,color);             //7
		a++;
		if((a*a+b*b)>(r*r))//�ж�Ҫ���ĵ��Ƿ��Զ
		{
			b--;
		}
	}
}

